000_РОЗНИЦА_ЦЕНТР/src/Documents/ВозвратИнтернетЗаказа/ВозвратИнтернетЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратИнтернетЗаказа</name>
  <basedOn>Document.ЭлектроннаяНакладная</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <attributes>
    <name>ВладелецДисконтнойКарты</name>
    <comment>на 25.10.2018 не использовался - нужно заменить на чтонить полезное</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДисконтнаяКарта</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СкидкиРассчитаны</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВозвратаЗаказаПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипВозврата</name>
    <type>
      <types>EnumRef.ТипыВозвратаИнтернетЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяНакладная</name>
    <type>
      <types>DocumentRef.ЭлектроннаяНакладная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ВозвращенноеКоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиЗапросаДоступности</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАвтоматическойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловНачислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБонусныхБалловСписано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОкругления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОплатаЗаказа</name>
    <attributes>
      <name>НомерОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.ВидыОплатыЗаказаПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>EnumRef.ТипОплатыЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОплаты</name>
      <type>
        <types>EnumRef.СтатусОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отменён</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДОплаты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

000_РОЗНИЦА_ЦЕНТР/src/Documents/ВозвратИнтернетЗаказа/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ТоварыВыбраны = Ложь;
		
	Иначе
		
		ТоварыВыбраны = Истина;

	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если ТекущаяСтраница.Имя = "ГруппаТовары" И Не ТоварыВыбраны Тогда
		
		ОткрытиеФормыПодбора();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыВозвращенноеКоличествоУпаковокПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	СтруктураОтвета = ТоварыВозвращенноеКоличествоУпаковокПриИзмененииНаСервере(ТекущаяСтрока.КлючСвязиЗапросаДоступности);
	
	ТекущаяСтрока.Цена = СтруктураОтвета.Цена;
	ТекущаяСтрока.СуммаАвтоматическойСкидки = СтруктураОтвета.СуммаАвтоматическойСкидки * ТекущаяСтрока.ВозвращенноеКоличествоУпаковок / ТекущаяСтрока.КоличествоУпаковок;
	ТекущаяСтрока.СуммаРучнойСкидки = СтруктураОтвета.СуммаРучнойСкидки * ТекущаяСтрока.ВозвращенноеКоличествоУпаковок / ТекущаяСтрока.КоличествоУпаковок;
	ТекущаяСтрока.СуммаБонусныхБалловНачислено = СтруктураОтвета.СуммаБонусныхБалловНачислено * ТекущаяСтрока.ВозвращенноеКоличествоУпаковок / ТекущаяСтрока.КоличествоУпаковок;
	ТекущаяСтрока.СуммаБонусныхБалловСписано = СтруктураОтвета.СуммаБонусныхБалловСписано * ТекущаяСтрока.ВозвращенноеКоличествоУпаковок / ТекущаяСтрока.КоличествоУпаковок;
	ТекущаяСтрока.СуммаОкругления = СтруктураОтвета.СуммаОкругления * ТекущаяСтрока.ВозвращенноеКоличествоУпаковок / ТекущаяСтрока.КоличествоУпаковок;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.ВозвращенноеКоличествоУпаковок
		- ТекущаяСтрока.СуммаАвтоматическойСкидки
		- ТекущаяСтрока.СуммаРучнойСкидки
		- ТекущаяСтрока.СуммаБонусныхБалловСписано
		- ТекущаяСтрока.СуммаОкругления;
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма");

КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьИзЗаказа(Команда)

	ОткрытиеФормыПодбора();

 КонецПроцедуры

&НаКлиенте
Процедура СоздатьЭлектроннуюНакладную(Команда)

	Если Модифицированность или Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сначало запишите документ");
	
	Иначе
	
		ОповещениеПослеОтметкиЭлементов = Новый ОписаниеОповещения(
	     "ЗавершениеВводаНомерЭН", ЭтотОбъект
		 );	
	
		ПараметрыДляФормы = Новый Структура("ВозвратныйДокумент", Объект.Ссылка);
		ОткрытьФорму("Документ.ВозвратИнтернетЗаказа.Форма.ФормаСозданияЭН",
				ПараметрыДляФормы,
				ЭтотОбъект,
				,
				,
				,
				ОповещениеПослеОтметкиЭлементов,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьИзЗаказа()
	
	Результат = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаВозврата.КлючСвязиЗапросаДоступности КАК КлючСвязиЗапросаДоступности,
		|	ТаблицаВозврата.КоличествоУпаковок КАК КоличествоУпаковок,
		|	&ЗаказПокупателя КАК ЗаказПокупателя
		|ПОМЕСТИТЬ ТаблицаВозврата
		|ИЗ
		|	&ТаблицаВозврата КАК ТаблицаВозврата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТоваров.Номенклатура КАК Номенклатура,
		|	ЕСТЬNULL(ТаблицаВозврата.КоличествоУпаковок, 0) КАК КоличествоУпаковок,
		|	ТаблицаТоваров.КоличествоУпаковок КАК КоличествоВЗаказе,
		|	ТаблицаТоваров.Упаковка КАК Упаковка,
		|	ТаблицаТоваров.КлючСвязиЗапросаДоступности КАК КлючСвязиЗапросаДоступности
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ТаблицаТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаВозврата КАК ТаблицаВозврата
		|		ПО ТаблицаВозврата.КлючСвязиЗапросаДоступности = ТаблицаТоваров.КлючСвязиЗапросаДоступности
		|		И ТаблицаВозврата.ЗаказПокупателя = ТаблицаТоваров.Ссылка
		|ГДЕ
		|	ТаблицаТоваров.Ссылка = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", Объект.ДокументОснование);
	Запрос.УстановитьПараметр("ТаблицаВозврата", Объект.Товары.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТЗ Из РезультатЗапроса Цикл
		
		Результат.Добавить(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТЗ));

	КонецЦикла;

	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура ОткрытиеФормыПодбора()

	ОповещениеПослеОтметкиЭлементов = Новый ОписаниеОповещения(
	     "ПослеОтметкиЭлементов", ЭтотОбъект
	 );	
 
	ПараметрыДляФормы = Новый Структура("ПараметрыФормы", ЗаполнитьИзЗаказа());
	ОткрытьФорму("Документ.ВозвратИнтернетЗаказа.Форма.ФормаВыбораИзЗаказа",
			ПараметрыДляФормы,
			ЭтотОбъект,
			,
			,
			,
			ОповещениеПослеОтметкиЭлементов,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПослеОтметкиЭлементов(Элементы, Параметры) Экспорт
 
    Если ТипЗнч(Элементы) = Тип("Массив") Тогда
    	Объект.Товары.Очистить();
        Для Каждого СтрокаВозврата Из Элементы Цикл
        	
        	Если Не СтрокаВозврата.КоличествоУпаковок = 0 Тогда
				
				ТоварыВыбраны = Истина;
				НоваяСтрока = Объект.Товары.Добавить();
        	
        		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВозврата); 
        		       		
        	КонецЕсли;

        КонецЦикла;
    КонецЕсли;
 
КонецПроцедуры

&НаСервере
Функция ТоварыВозвращенноеКоличествоУпаковокПриИзмененииНаСервере(КлючСвязи)

	СтруктураОтвет = Новый Структура;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказПокупателяТовары.Цена,
		|	ЗаказПокупателяТовары.СуммаАвтоматическойСкидки,
		|	ЗаказПокупателяТовары.СуммаБонусныхБалловНачислено,
		|	ЗаказПокупателяТовары.СуммаБонусныхБалловСписано,
		|	ЗаказПокупателяТовары.СуммаОкругления,
		|	ЗаказПокупателяТовары.СуммаРучнойСкидки,
		|	ЗаказПокупателяТовары.Сумма
		|ИЗ
		|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
		|ГДЕ
		|	ЗаказПокупателяТовары.Ссылка = &Ссылка
		|	И ЗаказПокупателяТовары.КлючСвязиЗапросаДоступности = &КлючСвязиЗапросаДоступности";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);
	Запрос.УстановитьПараметр("КлючСвязиЗапросаДоступности", КлючСвязи);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	СтруктураОтвет = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса[0]);
	
	Возврат СтруктураОтвет;

КонецФункции

&НаКлиенте 
Процедура ЗавершениеВводаНомерЭН(Элементы, Параметры) Экспорт 
	
	Если ТипЗнч(Элементы) = Тип("ДокументСсылка.ЭлектроннаяНакладная") Тогда
		А = 1;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
